inventory/app/controllers/inventory_controller.rb

	def all
		skus = Sku.all
---
SELECT "skus".* FROM "skus"

	def new_sku
		sku_json = params[:sku]

		# Check if the sku parameter is provided
		if !sku_json then head :bad_request end

		# Pull the optional paramter token out of params
		token = sku_json[:token]

		# Check if token was provided, if not set to random UUID prefix
		if !token then token = token = UUIDTools::UUID.timestamp_create.to_s[0..7] end

		# Try to find an existing Sku with the same token prior to creating
		if sku_with_token(token) then head :bad_request end

		sku = Sku.create(:token => token, :description => sku_json[:description], :price_cents => sku_json[:price_cents], :quantity => sku_json[:quantity])
---
INSERT INTO "skus" ("token", "description", "quantity", "price_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["token", "[FILTERED]"], ["description", nil], ["quantity", nil], ["price_cents", nil], ["created_at", "2022-01-16 19:45:05.478270"], ["updated_at", "2022-01-16 19:45:05.478270"]]

	def sku_with_token(token)
		Sku.find_by(token: token)
---
SELECT "skus".* FROM "skus" WHERE "skus"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]